package StackQueue;

/**
 * 3. 크레인 인형뽑기(카카오)
 *
 * @설명: 게임개발자인 죠르디는 크레인 인형뽑기 기게를 모바일 게임으로 만들려고 합니다.
 * 죠르디는 게임의 재미를 높이기 위해 화면 구성과 규칙으 ㄹ다음과 같이 게임 로직에 반영하려고 합니다.
 *
 * (3-3 사진첨부)
 * 게임화면은 1x1 크기의 칸들로 이루어진 N X N 크기의 정사각 격자이며 위쪽에는 크레인이 있고 오른쪽에는 바구니가 있습니다.
 * (위 그림은 5x5 크기의 예시입니다.) 각 격자 칸에는 다양한 인형이 들어 있으며 인형이 없는 칸은 빈칸입니다.
 * 모든 인형은 1x1 크기의 격자 한칸을 차지하며 격자의 가장 아래 칸부터 차곡차곡 쌓여있습니다.
 * 게임 사용자는 크레인을 좌우로 움직여서 멈춘 위치에서 가장 위에 있는 인형으 ㄹ집어 올릴 수 있습니다. 집어 올린 인형은 바구니에 쌓이게 되는데.
 *
 * (하루 시간부족 , 다음시간에 더 작성)
 * */
public class 크래인인형뽑기_카카오 {
    public static void main(String[] args) {

    }
}
